[
  {
    "timestamp": 1746904151,
    "commit": "68e7d8b5bb347b6505bb4906d5fd6ba7c4ff907e",
    "body": "Spent the week going through a somewhat painful update from Unreal 5.4.4 to 5.5.4. My blame on it being Unreal has simmered as I found that I hit more issues that were either already in the build or things I've added in belief that it would fix the issues I was seeing from the upgrade.",
    "tags": []
  },
  {
    "timestamp": 1746905380,
    "commit": "7d23a3b30af1461d5072a5b2ff17dbf5e21a7c80",
    "body": "Found a map change crash when objects are on fire. Traced it back to a build called `new new new fire`, I think the issue might be related to the recent fire update. Just a hunch.",
    "tags": []
  },
  {
    "timestamp": 1746930915,
    "commit": "c2ebf183d8f0a470dd5e821ee3b22d9d165e0a08",
    "body": "Fixed crash. Crash was easy to fix, what wasn't was the new crash that crept in due to the cooker not including a gameplayeffect.",
    "tags": []
  },
  {
    "timestamp": 1746991426,
    "commit": "76636d666d90ddf42f9bb540d256ea91e296e9ac",
    "body": "Working on a html export of the .plan system so posts are public.",
    "tags": []
  },
  {
    "timestamp": 1747029799,
    "commit": "3b83bec8d66f8dac450d2a5ba6ff41c21eaf8b7c",
    "body": "Pushed webpage version of .plan and rss feed.",
    "tags": []
  },
  {
    "timestamp": 1747030103,
    "commit": "edb7615d55008da0629948be92c020968a97c306",
    "body": "Created scripts to generate webpage version of .plan and rss feed.",
    "tags": []
  },
  {
    "timestamp": 1747074271,
    "commit": "a3c9b8db7d623d3481b8e9bb8974641dbab62584",
    "body": "Back on build stability bugs hoping to get 5.5.4 ready to merge with main.",
    "tags": []
  },
  {
    "timestamp": 1747157083,
    "commit": "edab1e1bb7d97c1c08e633013e7398a8bbcd4f86",
    "body": "Hopefully the last major issue from the 5.5.4 upgrade is fixing the account log on issues.",
    "tags": []
  },
  {
    "timestamp": 1747186767,
    "commit": "429c326b36757fc3cfbf45cb413f3c3fc476064e",
    "body": "5.5.4 is now main. Also, added meta tags to the plan so link embeds show the latest post.",
    "tags": []
  },
  {
    "timestamp": 1747252158,
    "commit": "fea7a6b967438e25defd50ecfafa6077fd48937b",
    "body": "Cleaned up console warning messages. Feels good.",
    "tags": []
  },
  {
    "timestamp": 1747261265,
    "commit": "6f6633e2a9237656e1ee6d35e8d7468fbcac1eb1",
    "body": "Working on updating the skelve generation system so layouts have more governance over what is spawned.",
    "tags": []
  },
  {
    "timestamp": 1747421411,
    "commit": "71960134f3393434e4156608c76cde7b827fd757",
    "body": "First public playtest of 5.5.4 build and it went much smoother than last week. One crash relating to saving actors on map change related to missing attribute data. Success overall.",
    "tags": []
  },
  {
    "timestamp": 1747588061,
    "commit": "f0de2ca27801389c9533b3cf0c7e2b67769dc83a",
    "body": "Been back on the skelve generation system. Now uses a multipass format: Layout->Content->Block unused entrances. Allows for more passes to be added in future.",
    "tags": []
  },
  {
    "timestamp": 1747588387,
    "commit": "65446bb346687e448182b6d857ed3a610a08b8a3",
    "body": "One big change to the updated skelve generator is layout validity. When attempting to generate a new chamber (level chunk) it tests the space using a box overlap to see if it will fit or reject.",
    "tags": []
  },
  {
    "timestamp": 1747770987,
    "commit": "d4bab45ed3d6256d1a9f2bfaf842def8b55a7e9d",
    "body": "Wrote a SnapToCeiling command for UnrealEd. Why spend a few minutes moving actors, when you can spent a few hours writing and debugging a command. I can see it paying off in the future.",
    "tags": []
  },
  {
    "timestamp": 1747964947,
    "commit": "0c534924d0992d9c1632bfc831cfd544ab739d5a",
    "body": "Testing an early version of the new Skelve generator. The phase based generation is in now: Layout, content, exit capping. I see some refactoring already that will help give more data that's needed. Next phase is tackling the biome shifting using height as a driver.",
    "tags": []
  },
  {
    "timestamp": 1748049661,
    "commit": "9bdb857aebe439f76c72b9b7c98de2e107254a34",
    "body": "Test failed successfully. Levels failed to load on clients, I believe due to me using FlushLevelStreaming which stopped code from running until the level load was complete, but this pause caused client sync issues. The test gave us enough to think over things and present a new solution using OnLevelShown delegates to handle future updates, no need to pause code.",
    "tags": []
  },
  {
    "timestamp": 1748237479,
    "commit": "91d05ca40bb9a82afce78009d6778530b98d8c8d",
    "body": "Added a chamber graph so we eventually spawn chambers with an understanding of their surroundings, helping build out logical spaces using rules instead of generating skelves using pure random items from a lightly filtered list.",
    "tags": []
  },
  {
    "timestamp": 1748380083,
    "commit": "9fbc00a4f0a42ff5d7c19ccef744fef5499d71d5",
    "body": "Rewriting what was the POI spawning system, which I'm now calling the Chamber Props system. It spawns crafted scenes of actors at predefined locations in a skelve with the intention of looking appropriate to the surroundings. The goal is to craft a language using gameplaytags where these can be built independent of location and picked to spawn based on the applied tags.",
    "tags": []
  },
  {
    "timestamp": 1748891497,
    "commit": "2dfb7710157c6af0c53487587e9310948d7e331d",
    "body": "After a long wait, it's finally time to start working on a v1 rope system. v1 is how we describe the most minimal implementation of an idea to get something tested quick and early. This version of rope will allow players to deploy it down vertical drops where it will then mimic the behaviour of a ladder for others to climb. It will also support collecting to deploy elsewhere.",
    "tags": []
  },
  {
    "timestamp": 1749246969,
    "commit": "207dc15d4b5fc450f00cb63eeeafee26d686a121",
    "body": "Tested a very early version of the rope, barely a v1, but it worked as far as showing off the potential of what it's like to explore underground caverns where you can dangle a rope off deep ledges and rappel down into the dark below. Work now continues to polish up the gameplay for that actual v1.",
    "tags": []
  },
  {
    "timestamp": 1749248691,
    "commit": "f99995d2f2d3d5ee246b5088ade4121956d05686",
    "body": "Got a bunch of rope fixes done to get characters attached to the rope and facing the right direction. Just setting the actor position/rotation for now and later we can figure out animating them. Next big task is allowing characters to rotate around the rope.",
    "tags": []
  },
  {
    "timestamp": 1749485501,
    "commit": "481c4e85547f1e45b0d874b1b4936e022086c48d",
    "body": "Getting into the deep stuff now. Basic setup for rope locomotion is there, but the networking side is weak with client desync issues occurring during collision events. Time to do a deep dive into the Unreal Character Movement Component and the networking code.",
    "tags": []
  },
  {
    "timestamp": 1749833974,
    "commit": "e74b94326f4f91da4f6f7d2d6eafb48abd2d3aaf",
    "body": "After a long deep dive into the workings of the CMC we now have a rope climbing movement mode as well as a simple mantle off step. Lots to polish up, but the playtest went well with proving the networking portion stays in sync.",
    "tags": []
  },
  {
    "timestamp": 1750178653,
    "commit": "c601f824bef160aa3eee8b8e5f55437f17b7aadd",
    "body": "Spent a day trying to debug an issue with a root motion animation not negating the animation offset. This took me on a journey of recreating the skeleton, rigging, skinning and fixing animations only to find that it was just an editor visualization setting and the animation was fine all along. Reverted a bunch of work, but gained new knowledge.",
    "tags": []
  },
  {
    "timestamp": 1750270496,
    "commit": "1d919b040d07a335a1a8de024cfc108558e6c670",
    "body": "Got a basic handle on setting up root motion animations with a working example of mantling up ledges and other heights. This should aid with player navigation and reduce the reliance on jump serving as a vertical climbing method as jump is meant to be more for crossing distances.",
    "tags": []
  },
  {
    "timestamp": 1750270575,
    "commit": "88bd8e99e7a7f3274382b7239ec1fe275b2399a2",
    "body": "Currently working on getting the camera to follow certain root motion animations when it makes sense. Working example is climbing on to rope from above, which requires the character to perform a 180 rotation onto the rope.",
    "tags": []
  },
  {
    "timestamp": 1750448226,
    "commit": "e838f50a4182958ee04c9c8bfc3e7845139b53dc",
    "body": "Playtest for mantle and rope climb went well for a first pass. Focus can now be put onto bug fixing and improvements to the ux. Players feels more dynamic now they can climb ledges, this might require more adjustments to the environment to ensure we don't start to see too much independence again and lose the group support dynamic.",
    "tags": []
  },
  {
    "timestamp": 1750975663,
    "commit": "15e9a822749a0f933c56dbf4fca3c4d1d68f6267",
    "body": "Though the rope climbing worked, when improving the climb onto rope root motion animation I found I had to do a good amount of rework to improve synchronization. Not perfect, but better now.",
    "tags": []
  },
  {
    "timestamp": 1750975750,
    "commit": "4bf695b83b30d9888a8bf8a8ea1c90aedb2eb7b0",
    "body": "Spent more time on rope UX. The rope object can now be picked up, deployed and picked up again. Sorry to anyone currently hanging on for dear life, for now you fall.",
    "tags": []
  },
  {
    "timestamp": 1751486600,
    "commit": "7063bbcc698fd8146460d12f0fb21f86fdb2c1ab",
    "body": "Updated the chamber generation system to use Unreal's fast tarray serializer to reduce replication overhead by sending delta updates.",
    "tags": []
  },
  {
    "timestamp": 1751486680,
    "commit": "185c31bc0e9cc19050be52402e33d8c89d830561",
    "body": "Working on player inventory interface to improve ux for held, shouldered and attached items.",
    "tags": []
  }
]